IDENTIFICATION DIVISION.
PROGRAM-ID. CREATE-ACCOUNT-ITK2.

ENVIRONMENT DIVISION.
INPUT-OUTPIUT SECTION.
FILE-CONTROL.
    SELECT USER-FILE ASSIGN TO "users.dat"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD USER-FILE.
01 USER-LINE   PIC X(80).

WORKING-STORAGE SECTION.
01 USERNAME-IN    PIC X(20).
01 PASSWORD-IN    PIC X(20).
01 FILE-USERNAME PIC X(20).
01 FILE-PASSWORD PIC X(20).
01 FOUND-FLAG    PIC X VALUE 'N'.
01 EOF-FLAG     PIC X VALUE 'N'.
01 OUT-LINE   PIC X(80).

PROCEDURE DIVISION.
MAIN.
    PERFORM ENSURE-FILE-EXISTS
    DISPLAY "Choose a username: " ACCEPT USERNAME-IN
    PERFORM CHECK-DUPLICATE-USERNAME
    IF FOUND-FLAG = 'Y'
        DISPLAY "Username already exists. Please choose another."
        STOP RUN
    END-IF
    DISPLAY "Choose a password: " ACCEPT PASSWORD-IN
    STRING FUNCTION TRIM(USERNAME-IN) "," FUNCTION TRIM(PASSWORD-IN)
        DELIMITED BY SIZE INTO OUT-LINE
    END-STRING
    OPEN EXTEND USER-FILE
    WRITE USER-LINE FROM OUT-LINE
    CLOSE USER-FILE
    DISPLAY "Account created successfully."
    STOP RUN.

ENSURE-FILE-EXISTS.
    OPEN EXTEND USER-FILE
    CLOSE USER-FILE.

CHECK-DUPLICATE-USERNAME.
    MOVE "N" TO FOUND-FLAG
    MOVE "N" TO E0F-FLAG
    OPEN INPUT USER-FILE
    PERFORM UNTIL EOF-FLAG = "Y"
       READ USER-FILE
           AT END MOVE "Y" TO EOF-FLAG
           NOT AT END
               UNSTRING USER-LINE DELIMITED BY ","
                   INTO FILE-USERNAME FILE-PASSWORD
               IF FUNCTION TRIM(FILE-USERNAME)
                   = FUNCTION TRIM(USERNAME-IN)
                   MOVE "Y" TO FOUND-FLAG
                   MOVE "Y" TO EOF-FLAG
               END-IF
       END-READ
    END-PERFORM
    CLOSE USER-FILE.
